In [1]:
import numpy as np
import pandas as pd

In [2]:
from pandas import *
from numpy import *


# DataFrame (Pandas)

## 一、生成一个DataFrame
### 1. 存整数的DataFrame

In [3]:
df = DataFrame(np.arange(16).reshape(4,4), index= list("ABCD"), columns=list('wxyz'))
df

    w   x   y   z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15

In [4]:
df = DataFrame(np.random.randint(low=0, high=10, size=(3,5)))
df

   0  1  2  3  4
0  0  8  1  1  8
1  6  9  2  0  4
2  9  6  3  1  6

### 2. 浮点数的DataFrame

In [5]:
df = DataFrame(np.random.random(size=(3,5)))
df

          0         1         2         3         4
0  0.697792  0.346097  0.223942  0.605700  0.666776
1  0.554882  0.727818  0.088757  0.347813  0.418222
2  0.660719  0.168734  0.463950  0.090598  0.488722

## 二、查看数据

### 1. 查看行数据

In [6]:
data = np.arange(9).reshape(3,3);
frame = DataFrame(data);
frame

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [7]:
#  查看 所有数据
frame.head()
# or
frame.tail()

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [8]:
#  查看前 2 行
frame.head(2)

   0  1  2
0  0  1  2
1  3  4  5

In [9]:
#  查看后 2 行
frame.tail(2)

   0  1  2
1  3  4  5
2  6  7  8

### 2. 转置

In [10]:
# 转置 （行 -> 列）
frame.T

   0  1  2
0  0  3  6
1  1  4  7
2  2  5  8

### 3. index、columns、values 查看

In [11]:
frame = DataFrame(data, index=list('abc'), columns=list('ABC'))
# frame = DataFrame(data);
frame

   A  B  C
a  0  1  2
b  3  4  5
c  6  7  8

In [12]:
frame.index

Index(['a', 'b', 'c'], dtype='object')

In [13]:
frame.columns

Index(['A', 'B', 'C'], dtype='object')

In [14]:
frame.values

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

### 4. 轴排序

In [15]:
frame = DataFrame(np.random.randint(low=0, high=10, size=(3,5)), columns=list('ABCDE'))
frame

   A  B  C  D  E
0  9  7  4  4  6
1  0  9  1  4  2
2  3  2  3  4  5

In [16]:
# （default）axis = 0 , 对 index 进行排序
# axis = 1 , 对columns 进行排序
res = frame.sort_index(axis=1, ascending=False);
res

   E  D  C  B  A
0  6  4  4  7  9
1  2  4  1  9  0
2  5  4  3  2  3

### 5. 值排序

In [17]:
frame = DataFrame(np.random.randint(low=0, high=10, size=(3,5)), columns=list('ABCDE'))
print(frame)
# inplace = True 时，源DataFrame 数据会改变
res = frame.sort_values(by=['C','D'], axis=0, ascending=True, inplace = False, na_position='last')
res

   A  B  C  D  E
0  0  3  5  2  7
1  7  0  3  0  1
2  4  7  8  4  6

   A  B  C  D  E
1  7  0  3  0  1
0  0  3  5  2  7
2  4  7  8  4  6

## 三、筛选

### 1. 一行、一列

In [18]:
frame = DataFrame({'name':['Jasper','Fang','Ming'], 'age': [18, 19, 20]})
frame

     name  age
0  Jasper   18
1    Fang   19
2    Ming   20

In [19]:
# 一行
# frame.loc[0]
frame.iloc[0]

name    Jasper
age         18
Name: 0, dtype: object

In [20]:
# 一列
frame.loc[:, ['name']]
# frame.iloc[:, [0]]

# Series
# res = frame.loc[:]['name']

     name
0  Jasper
1    Fang
2    Ming

### 2. 筛选特定的位置

In [21]:
frame = DataFrame({'name':['Jasper','Fang','Ming'], 'age': [18, 19, 20], 'salary': [1800.0, 1955.5, 2230.8]})
frame

     name  age  salary
0  Jasper   18  1800.0
1    Fang   19  1955.5
2    Ming   20  2230.8

In [22]:
# 前两行，前两列 （0,1）
frame.iloc[:2, :2]

     name  age
0  Jasper   18
1    Fang   19

In [23]:
# 第1、3 行的第2列
frame.loc[[0,2], ['age']]

   age
0   18
2   20

### 3. 列条件 筛选

In [24]:
frame = DataFrame({'name':['Jasper','Fang','Ming'], 'age': [18, 19, 20], 'salary': [1800.0, np.nan, 2230.8]})
frame

     name  age  salary
0  Jasper   18  1800.0
1    Fang   19     NaN
2    Ming   20  2230.8

In [25]:
frame[frame['age']<=18]

     name  age  salary
0  Jasper   18  1800.0

In [26]:
# salary 列 中， 为空的那一行
frame[np.isnan(frame['salary'])]

   name  age  salary
1  Fang   19     NaN

In [27]:
# salary 列中，不为空的记录

# 删除 整行都是NaN 的行
res = frame.dropna(axis=0, how='all')
# 删除一行中存在NaN 的行
res = frame.dropna(axis=0, how='any')
# 删除 一列中存在NaN的列
res = frame.dropna(axis=1, how='any')
res

     name  age
0  Jasper   18
1    Fang   19
2    Ming   20

## 四、赋值

In [38]:
frame = DataFrame([[1,2,3],[1,2,3]])
frame

   0  1  2
0  1  2  3
1  1  2  3

In [39]:
# 第一行 赋值
frame.iloc[0] = 8
frame

   0  1  2
0  8  8  8
1  1  2  3

In [40]:
# 第 0 列赋值
# frame[0] = 22
# 第 0，2 列 赋值
frame.iloc[:,[0,2]] = -3
frame

   0  1  2
0 -3  8 -3
1 -3  2 -3

In [41]:
#  将frame 中所有大于0 的数，转成 负数
frame[frame > 0] = -frame
frame

   0  1  2
0 -3 -8 -3
1 -3 -2 -3

## 五、缺失值处理（NaN）

### 1. reindex() vs reset_index()
* reindex
  * 作用：对指定轴上的索引进行改变/增加/删除操作，并返回原始数据的一个拷贝。
* reset_index
  * 作用：重新整理乱序的index，并返回一个拷贝。

In [44]:
df = DataFrame({'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50]})
df2 = DataFrame({'A': [6], 'B':[60]})
print('df\n', df)
print('df2\n', df2)

df
    A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50
df2
    A   B
0  6  60

In [45]:
# 合并 两个 df， 发现，index 是 乱的
df_x = [df, df2]
result = pd.concat(df_x)
result

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50
0  6  60

In [48]:
# 重新整理 index， 并且， index 单独出来了一列
# drop=True时，不会生成单独一列 index
# result2 = result.reset_index()
result2 = result.reset_index(drop=True)
result2

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50
5  6  60

In [50]:
# 这是乱序的合并result
result

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50
0  6  60

In [52]:
# 根据源对象，构造不同的新对象
result3 = result.reindex(columns=['A','C'])
result3

   A   C
0  1 NaN
1  2 NaN
2  3 NaN
3  4 NaN
4  5 NaN
0  6 NaN

### 2. 缺失值填充

In [54]:
df = DataFrame({'A': [np.nan, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50]})
df

     A   B
0  NaN  10
1  2.0  20
2  3.0  30
3  4.0  40
4  5.0  50

In [55]:
df.fillna(value=-999)

       A   B
0 -999.0  10
1    2.0  20
2    3.0  30
3    4.0  40
4    5.0  50

In [56]:
# 不改变源对象
df

     A   B
0  NaN  10
1  2.0  20
2  3.0  30
3  4.0  40
4  5.0  50

### 3. 删除有空值的行和列（请看上面的例子）

## 六、 合并

### 1. 合并 -- concat()

#### axis = 0/1
哪个方向合并，默认 0， 纵向合并

In [61]:
df1 = pd.DataFrame(np.ones((3,4))*0, columns = ['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.ones((3,4))*1, columns = ['a', 'b', 'c', 'd'])
df3 = pd.DataFrame(np.ones((3,4))*2, columns = ['a', 'b', 'c', 'd'])

In [62]:
# axis =0 表示竖向的合并
result = concat([df1, df2, df3], axis=0)
result

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
0  2.0  2.0  2.0  2.0
1  2.0  2.0  2.0  2.0
2  2.0  2.0  2.0  2.0

In [64]:
# axis =1 表示横向的合并
result = concat([df1, df2, df3], axis=1)
result

     a    b    c    d    a    b    c    d    a    b    c    d
0  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0  2.0  2.0  2.0  2.0
1  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0  2.0  2.0  2.0  2.0
2  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0  2.0  2.0  2.0  2.0

#### ignore_index = True/False
是否忽略原来的index重新build index， default 不忽略

In [65]:
result = concat([df1, df2, df3], axis=0, ignore_index=True)
result

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0
5  1.0  1.0  1.0  1.0
6  2.0  2.0  2.0  2.0
7  2.0  2.0  2.0  2.0
8  2.0  2.0  2.0  2.0

### join
* 'inner'： 只保留column名相同的部分

In [67]:
df1 = pd.DataFrame(np.ones((3,4))*0, columns = ['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.ones((3,4))*1, columns = ['a', 'b', 'c', 'e'])

result = concat([df1, df2], axis=0, join='inner')
result

     a    b    c
0  0.0  0.0  0.0
1  0.0  0.0  0.0
2  0.0  0.0  0.0
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0

#### join_axes
A left join B

In [69]:
df1 = pd.DataFrame(np.ones((3,4))*0, columns = ['a', 'b', 'c', 'd'], index=[1, 2, 3])
df2 = pd.DataFrame(np.ones((3,4))*1, columns = ['b', 'c', 'd', 'e'], index=[2, 3, 4])
result=pd.concat([df1,df2], axis=1)
result

     a    b    c    d    b    c    d    e
1  0.0  0.0  0.0  0.0  NaN  NaN  NaN  NaN
2  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0
3  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0
4  NaN  NaN  NaN  NaN  1.0  1.0  1.0  1.0

In [70]:
# 采用 inner join 的方式，就可以去除 指定的空行
# df1 inner join df2
result = pd.concat([df1, df2], axis=1, join_axes=[df1.index])
result

     a    b    c    d    b    c    d    e
1  0.0  0.0  0.0  0.0  NaN  NaN  NaN  NaN
2  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0
3  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0

### 2. 合并 -- append()
作用： 将一行或者多行数据连接到一个DataFrame上

只有竖向往下加数据，没有axis属性

In [72]:
df1 = DataFrame(np.ones((3,4))*0, columns = ['a', 'b', 'c', 'd'], index=[1, 2, 3])
df2 = DataFrame(np.ones((3,4))*1, columns = ['b', 'c', 'd', 'e'], index=[2, 3, 4])
df3 = DataFrame(np.ones((3,4))*2, columns = ['b', 'c', 'd', 'e'], index=[2, 3, 4])
df1 = df1.append([df2, df3], ignore_index= True)
df1

     a    b    c    d    e
0  0.0  0.0  0.0  0.0  NaN
1  0.0  0.0  0.0  0.0  NaN
2  0.0  0.0  0.0  0.0  NaN
3  NaN  1.0  1.0  1.0  1.0
4  NaN  1.0  1.0  1.0  1.0
5  NaN  1.0  1.0  1.0  1.0
6  NaN  2.0  2.0  2.0  2.0
7  NaN  2.0  2.0  2.0  2.0
8  NaN  2.0  2.0  2.0  2.0

### 3. 合并 -- mrge()
类似 数据库中的left join、right join 等
* 内连接，`pd.merge(a1, a2, on='key')`
* 左连接，`pd.merge(a1, a2, on='key', how='left')`
* 右连接，`pd.merge(a1, a2, on='key', how='right')`
* 外连接，`pd.merge(a1, a2, on='key', how='outer')`

#### 一个key

In [74]:
left=pd.DataFrame({'key':['K0','K1','K2','K3'],
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3']})
right=pd.DataFrame({'key':['K0','K1','K2','K3'],
    'C':['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3']})

print('left\n', left)
print('right\n', right)

left
   key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
right
   key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [76]:
res = merge(left, right)
# 自动选择那个同名的column作为key，只要key相同，就merge
# res = merge(left, right, on=['key'])
res

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

#### 多个key，how可取['left', 'right', 'inner', 'outer']

In [77]:
left=pd.DataFrame({'key1':['K0','K0','K1','K2'],
    'key2':['K0','K1','K0','K1'],
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3']})
right=pd.DataFrame({'key1':['K0','K1','K1','K2'],
    'key2':['K0','K0','K0','K0'],
    'C':['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3']})

In [78]:
res=pd.merge(left,right,on=['key1','key2'], how = 'outer')
res

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

## 七、分组（groupby）

In [81]:
# pd.date_range 生成连续指定天数的日期
def shuju():
    data={
        'date':pd.date_range('20000101',periods=10),
        'gender':np.random.randint(0,2,size=10),
        'height':np.random.randint(40,50,size=10),
        'weight':np.random.randint(150,180,size=10)
    }
    return data

df=DataFrame(shuju())
print(df)

        date  gender  height  weight
0 2000-01-01       0      41     154
1 2000-01-02       0      40     160
2 2000-01-03       0      45     165
3 2000-01-04       0      45     162
4 2000-01-05       1      41     159
5 2000-01-06       0      42     164
6 2000-01-07       1      41     154
7 2000-01-08       0      46     150
8 2000-01-09       1      42     169
9 2000-01-10       1      49     150

In [83]:
# sum() 输出每一个group 的该列的元素的总和值（只有 number 的列被统计）
df.groupby('gender').sum()

        height  weight
gender
0          259     955
1          173     632

In [84]:
# size() 统计每一组的行数
df.groupby('gender').size()

gender
0    6
1    4
dtype: int64

## 八、一些操作

* 平均数：mean()

In [85]:
df = DataFrame({'A': [np.nan, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50]})
df

     A   B
0  NaN  10
1  2.0  20
2  3.0  30
3  4.0  40
4  5.0  50

In [89]:
#  每一列的平均值
df.mean()

A     3.5
B    30.0
dtype: float64

In [88]:
#  每一行的平均值
df.mean(1)

0    10.0
1    11.0
2    16.5
3    22.0
4    27.5
dtype: float64

* 统计某一列x中各个值出现的次数：`a['x'].value_counts()`

In [90]:
df['A'].value_counts()

5.0    1
4.0    1
3.0    1
2.0    1
Name: A, dtype: int64

* 对数据应用函数: `a.apply(lambda x:x.max()-x.min())` 表示返回所有列中最大值-最小值的差。

* 字符串操作：`a['gender1'].str.lower() `表示将gender1中所有英文大写转小写。